// G. Линейный поиск

// Задана последовательность из N чисел и задано еще одно число, необходимо найти позицию этого числа в последовательности или выдать, что такого числа нет
// Входные данные
// на вход подается в первой строке число N - количество чисел в последовательности, в следующей строке написано N чисел - сама последовательность,
//  а в последней строке входного файла написано число, которое нужно найти в последовательности
// Выходные данные
// в выходной поток необходимо выдать, номер этого числа в последовательности или -1 если заданного числа в последовательности нет
// Примеры
// входные данные
// Скопировать
// 2
// 1 2
// 1
// выходные данные
// Скопировать
// 1
// входные данные
// Скопировать
// 5
// 1 2 3 4 5
// 2
// выходные данные
// Скопировать
// 2

int NumberPosition(int[] arr, int num)
{
    int position = -1;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] == num)
        {
            position = i + 1;
            break;
        }
    }
    return position;
}

int N = Convert.ToInt32(Console.ReadLine()); //N - количество чисел в последовательности
int[] numbers = Console.ReadLine().Split(' ').Select(n => int.Parse(n)).ToArray(); //последовательность
int findNumber = Convert.ToInt32(Console.ReadLine()); //число, которое нужно найти в последовательности

Console.WriteLine(NumberPosition(numbers, findNumber));