// D. Наименьшее число

// Дана последовательность чисел. Найти в ней наименьшее число.
// Входные данные
// Сначала задано число N - количество чисел в последовательности, а затем N чисел (1 <  = N <  = 100).
// Выходные данные
// Выведите наименьшее число.
// Примеры
// входные данные
// Скопировать
// 7
// 
// выходные данные
// Скопировать
// 0

int N = Convert.ToInt32(Console.ReadLine()); //N чисел (1 <  = N <  = 100)
// N целых чисел, по модулю не превышающих 1000.
int[] numbers = Console.ReadLine().Split(' ').Select(n => int.Parse(n)).ToArray();

int min = numbers[0];

for (int i = 1; i < N; i++)
    if (numbers[i] < min) min = numbers[i];

Console.WriteLine(min);