// F. Сумма элементов массива

// Задана последовательность из N чисел, необходимо посчитать сумму элементов этой последовательности
// Входные данные
// В первой строке входного потока задано число N, не превышающее 1000, - количество элементов 
// этой последовательности, во второй строке заданы N чисел, не превышающих 10000
// Выходные данные
// На выход необходимо вывести одно число - сумму элементов последовательности
// Примеры
// входные данные
// Скопировать
// 2
// 1 2
// выходные данные
// Скопировать
// 3
// входные данные
// Скопировать
// 5
// 1 2 3 4 5
// выходные данные
// Скопировать
// 15

int N = Convert.ToInt32(Console.ReadLine()); //N, не превышающее 1000, - количество элементов 
// N целых чисел, по модулю не превышающих 1000.
int[] numbers = Console.ReadLine().Split(' ').Select(n => int.Parse(n)).ToArray();

int sum = 0;

for (int i = 0; i < N; i++)
    sum += numbers[i];

Console.WriteLine(sum);
