// H. Ваня и книги

// Ване поручено важное задание — он должен пронумеровать книжки в библиотеке, поставив на каждую бирку книжку с её номером. 
// Каждая из n книг должна получить номер от 1 до n, причем, разумеется, разные книги должны получить разные номера.
// Ваня хочет узнать, какое количество цифр ему придётся написать, подписывая все бирки.
// Входные данные
// В первой строке содержатся целое число n (1 ≤ n ≤ 109) — количество книг в библиотеке.
// Выходные данные
// Выведите количество цифр, нужных для того, чтобы пронумеровать все книги.
// Примеры
// входные данные
// Скопировать
// 13
// выходные данные
// Скопировать
// 17
// входные данные
// Скопировать
// 4
// выходные данные
// Скопировать
// 4
// Примечание
// Пояснение к первому тесту. Книги получат номера 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, что в сумме даёт 17 цифр.
// Пояснение ко второму тесту. Книги получат номера 1, 2, 3, 4, что в сумме даёт 4 цифры.

int DidgitsInNumber(int num)
{
    int count = 0;
    while (num > 0)
    {
        count++;
        num /= 10;
    }
    return count;
}


int n = Convert.ToInt32(Console.ReadLine()); //число n (1 ≤ n ≤ 109) — количество книг в библиотеке.

int totalDigits = 0;
for (int i = 1; i <= n; i++)
    totalDigits += DidgitsInNumber(i);

Console.WriteLine(totalDigits);