// B. Круглый дом
// ограничение по времени на тест
// 1 секунда
// ограничение по памяти на тест
// 256 мегабайт
// ввод
// стандартный ввод
// вывод
// стандартный вывод
// Вася живёт в круглом доме, подъезды которого последовательно пронумерованы целыми числами от 1 до n. Причём подъезды номер n и номер 1 являются соседними.
// Сегодня Васе стало скучно, и он решил погулять во дворе. Вася живёт в подъезде номер a, и он решил, что его прогулка будет заключаться в движении вокруг дома 
// в порядке возрастания номеров подъездов на b подъездов (в таком порядке после подъезда номер n следует подъезд номер 1). 
// Отрицательное значение b соответствует движению в порядке убывания номеров подъездов на |b| подъездов (в таком порядке после подъезда номер 1 следует подъезд номер n). 
// Если же b = 0, то Вася предпочитает гулять рядом со своим подъездом.

// Помогите Васе определить номер подъезда, возле которого он окажется в конце своей прогулки.
// Входные данные
// В единственной строке входного файла через пробел заданы три целых числа n, a и b (1 ≤ n ≤ 100, 1 ≤ a ≤ n,  - 100 ≤ b ≤ 100) — количество подъездов в доме Васи, номер его подъезда и длина его прогулки соответственно.
// Выходные данные
// Выведите единственное целое число k (1 ≤ k ≤ n) — номер подъезда, возле которого Вася окажется в конце своей прогулки.
// Примеры
// входные данные
// Скопировать
// 6 2 -5
// выходные данные
// Скопировать
// 3
// входные данные
// Скопировать
// 5 1 3
// выходные данные
// Скопировать
// 4
// входные данные
// Скопировать
// 3 2 7
// выходные данные
// Скопировать
// 3

int n = Convert.ToInt32(Console.ReadLine()); //(1 ≤ n ≤ 100, 1 ≤ a ≤ n,  - 100 ≤ b ≤ 100) — количество подъездов в доме Васи
int a = Convert.ToInt32(Console.ReadLine()); // номер его подъезда
int b = Convert.ToInt32(Console.ReadLine()); // длина его прогулки соответственно.

Console.WriteLine(Math.Abs(a + b) % n == 0 ? n : Math.Abs(a + b) % n); //номер подъезда, возле которого Вася окажется в конце своей прогулки.