// I. Юра и заселение

// Недавно Юра поступил в БГУКП (Берляндский Государственный Университет Крутых Программистов). У Юры есть друг Леша, который поступил вместе с ним, и теперь они заселяются в общежитие.
// Юра и Леша хотят жить в одной комнате. Всего в общежитии есть n комнат. В данный момент в комнате с номером i живут pi человек, 
// когда всего в этой комнате может жить qi человек (pi ≤ qi). Посчитайте, сколько комнат общежития смогут вместить Юру и Лешу вместе?
// Входные данные
// В первой строке содержится единственное целое число n (1 ≤ n ≤ 100) — количество комнат.
// В i-й из n последующих строк содержатся два целых числа pi и qi (0 ≤ pi ≤ qi ≤ 100) — количество людей, которые уже живут в комнате, 
// и максимальное допустимое количество людей, живущих в i-й комнате.
// Выходные данные
// Выведите одно целое число — количество комнат, в которые Юра с Лешей могут заселиться.
// Примеры
// входные данные
// Скопировать
// 3
// 1 1
// 2 2
// 3 3
// выходные данные
// Скопировать
// 0
// входные данные
// Скопировать
// 3
// 1 10
// 0 10
// 10 10
// выходные данные
// Скопировать
// 2

int n = Convert.ToInt32(Console.ReadLine()); //n (1 ≤ n ≤ 100) — количество комнат

int[,] roomsFilled = new int[n, 2];//pi и qi (0 ≤ pi ≤ qi ≤ 100) — количество людей, которые уже живут в комнате, и максимальное допустимое количество людей, живущих в i-й комнате.
for (int i = 0; i < n; i++)
{
    int[] line = Console.ReadLine().Split(' ').Select(el => int.Parse(el)).ToArray();
    roomsFilled[i, 0] = line[0];
    roomsFilled[i, 1] = line[1];
}

int roomsFreeForFriends = 0, friendsNumber = 2;
for (int i = 0; i < n; i++)
{
    if (Math.Abs(roomsFilled[i, 1] - roomsFilled[i, 0]) >= friendsNumber) roomsFreeForFriends++;
}
Console.WriteLine(roomsFreeForFriends);