// J. Почти счастливое число
// ограничение по времени на тест
// 2 seconds
// ограничение по памяти на тест
// 256 megabytes
// ввод
// стандартный ввод
// вывод
// стандартный вывод
// Петя любит счастливые числа. Всем известно, что счастливыми являются положительные целые числа, в десятичной записи которых содержатся только счастливые цифры 4 и 7. 
// Например, числа 47, 744, 4 являются счастливыми, а 5, 17, 467 — не являются.
// К сожалению, не все числа счастливые. Петя называет число почти счастливым, если количество счастливых цифр в нем — счастливое число. Ему интересно, 
// является ли число n почти счастливым.
// Входные данные
// В единственной строке задано целое число n (1 ≤ n ≤ 1018).

// Выходные данные
// В единственной строке выведите «YES», если число n — почти счастливое, и «NO» в противном случае (без кавычек).
// Примеры
// входные данные
// Скопировать
// 40047
// выходные данные
// Скопировать
// NO
// входные данные
// Скопировать
// 7747774
// выходные данные
// Скопировать
// YES
// входные данные
// Скопировать
// 1000000000000000000
// выходные данные
// Скопировать
// NO
// Примечание
// В первом примере количество счастливых цифр числа равно 3 (первая и последние две цифры), поэтому ответ «NO».
// Во втором примере все цифры числа — счастливые, а их общее количество — 7, поэтому ответ «YES».
// В третьем примере в числе нет счастливых цифр, поэтому ответ «NO».

long n = int.Parse(Console.ReadLine()); //В единственной строке задано целое число n (1 ≤ n ≤ 1018).

long nCopy = n;
int happyNumber1 = 4, happyNumber2 = 7;
int happyDigits = 0, totalDigits = 0;

while (nCopy > 0)
{
    totalDigits++;
    if (nCopy % 10 == happyNumber1 || nCopy % 10 == happyNumber2) happyDigits++;
    nCopy /= 10;
}

if ((totalDigits == happyDigits) || ((happyDigits != 0) && (happyDigits % happyNumber1 == 0 || happyDigits % happyNumber2 == 0)))
{
    Console.WriteLine("YES");
}
else
{
    Console.WriteLine("NO");
}