// A. Номера домов
// Главная улица в Берляндии представляет собой прямую, вдоль которой построены n домов (n — чётное число). Дома расположены с обеих сторон улицы. 
// Дома с нечётными номерами находятся с одной стороны улицы и нумеруются от 1 до n - 1 в порядке от начала улицы к её концу (на картинке слева направо). 
// Дома с чётными номерами находятся с другой стороны улицы и нумеруются от 2 до n в порядке от конца улицы к её началу (на картинке справа налево). 
// Соответствующие дома с чётными и нечётными номерами находятся строго друг напротив друга, то есть напротив дома номер 1 находится дом номер n, напротив дома номер 3 
// находится дом номер n - 2, напротив дома номер 5 находится дом номер n - 4 и так далее.

// Васе необходимо как можно скорее добраться до дома номер a. Он заезжает с начала улицы и двигается на автомобиле по ней до дома номер a. 
// Чтобы доехать от начала улицы до домов с номерами 1 и n, он тратит ровно 1 секунду. На то, чтобы проехать расстояние между двумя соседними домами, 
// он также тратит ровно одну секунду. Вася может припарковаться с любой стороны дороги, поэтому расстояние от начала улицы до домов, стоящих друг напротив друга,
// следует считать одинаковым.
// Перед вами стоит задача: найти минимальное время, по истечении которого Вася сможет добраться до дома с номером a.
// Входные данные
// В первой строке входных данных содержатся два целых числа n и a (1 ≤ a ≤ n ≤ 100 000) — количество домов на улице и номер дома, до которого нужно доехать Васе, соответственно. Гарантируется, что число n чётно.
// Выходные данные
// Выведите единственное целое число — минимальное время, за которое Вася сможет добраться от начала улицы до дома с номером a.
// Примеры
// входные данные
// Скопировать
// 4 2
// выходные данные
// Скопировать
// 2
// входные данные
// Скопировать
// 8 5
// выходные данные
// Скопировать
// 3
// Примечание
// В первом примере на улице всего четыре дома, по два с каждой стороны. Дом номер 2 будет последним по правую руку движения Васи.
// Второй пример соответствует картинке с n = 8. Дом номер 5 — предпоследний по левой (относительно Васи) стороне дороги.

int n = Convert.ToInt32(Console.ReadLine()); //(1 ≤ a ≤ n ≤ 100 000) — количество домов на улице
int a = Convert.ToInt32(Console.ReadLine()); //и номер дома, до которого нужно доехать Васе

int startI, endI, time, timeStep;
if (a % 2 == 0)
{
    startI = 2;
    endI = n;
    time = n / 2;
    timeStep = -1;
}
else
{
    startI = 1;
    endI = n - 1;
    time = 1;
    timeStep = 1;
}

for (int i = startI; i <= endI; i += 2)
{
    if (i == a) break;
    time += timeStep;
}

Console.WriteLine(time); //найти минимальное время, по истечении которого Вася сможет добраться до дома с номером a.

