// E. Наибольшее число

// Дано N целых чисел. Требуется выбрать из них максимальное число.
// Входные данные
// Вводится сначала число N - количество чисел в последовательности (1 <  = N <  = 100). 
// Далее записана сама последовательность: N целых чисел, по модулю не превышающих 1000.
// Выходные данные
// Выведите искомое число.
// Примеры
// входные данные
// Скопировать
// 9
// 3 5 1 7 9 0 9 -3 10
// выходные данные
// Скопировать
// 10
// входные данные
// Скопировать
// 3
// -5 -300 -12
// выходные данные
// Скопировать
// -5

int N = Convert.ToInt32(Console.ReadLine()); //N чисел (1 <  = N <  = 100)
// N целых чисел, по модулю не превышающих 1000.
int[] numbers = Console.ReadLine().Split(' ').Select(n => int.Parse(n)).ToArray();

int max = numbers[0];

for (int i = 1; i < N; i++)
    if (numbers[i] > max) max = numbers[i];

Console.WriteLine(max);