// C. Наибольшее произведение(2)

// Дано N целых чисел. Требуется выбрать из них три таких числа, произведение которых максимально.
// Входные данные
// Вводится сначала число N - количество чисел в последовательности (3 <  = N <  = 100). Далее 
// записана сама последовательность: N целых чисел, по модулю не превышающих 1000.
// Выходные данные
// Выведите три искомых числа в любом порядке. Если существует несколько различных троек чисел, 
// дающих максимальное произведение, то выведите любую из них.
// Примеры
// входные данные
// Скопировать
// 9
// 3 5 1 7 9 0 9 -3 10
// выходные данные
// Скопировать
// 9 9 10
// входные данные
// Скопировать
// 3
// -5 -300 -12
// выходные данные
// Скопировать
// 

void ArraySort(int[] arr)
{
    for (int i = 0; i < arr.Length; i++)
        for (int j = 0; j < arr.Length - i - 1; j++)
            if (arr[j] > arr[j + 1])
                (arr[j], arr[j + 1]) = (arr[j + 1], arr[j]);
}


int N = Convert.ToInt32(Console.ReadLine()); //N - количество чисел в последовательности (3 <  = N <  = 100)
// N целых чисел, по модулю не превышающих 1000.
int[] numbers = Console.ReadLine().Split(' ').Select(n => int.Parse(n)).ToArray();

ArraySort(numbers);

if (numbers[0] * numbers[1] > numbers[N - 1] * numbers[N - 2])
{
    Console.WriteLine(numbers[0] + " " + numbers[1] + " " + numbers[N - 1]);
}
else
{
    Console.WriteLine(numbers[N - 1] + " " + numbers[N - 2] + " " + numbers[N - 3]);
}