// G. Средство от бессонницы
// ограничение по времени на тест
// 2 seconds
// ограничение по памяти на тест
// 256 megabytes
// ввод
// стандартный ввод
// вывод
// стандартный вывод
// «Раз дракон. Два дракон. Три дракон», — считала принцесса. У нее была бессонница, а считать барашков ей надоело еще в девять лет.
// Впрочем, считать драконов просто так тоже было скучно, поэтому она развлекалась как могла. Этой ночью она представляла, что все посчитанные драконы явились сюда, 
// чтобы ее украсть, а она отбивается от них, как может. Каждого k-ого дракона она била сковородкой по морде. Каждому l-ому — прищемляла хвост балконной дверью.
// Каждому m-ому — наступала на лапу острым каблучком. Наконец, каждому n-ому она грозила позвать мамочку, и он в ужасе ретировался.

// Скольким воображаемым драконам успела нанести моральный или физический ущерб принцесса, если всего она насчитала d драконов?
// Входные данные
// Входные данные содержат целые числа k, l, m, n и d, каждое число в отдельной строке (1 ≤ k, l, m, n ≤ 10, 1 ≤ d ≤ 105).
// Выходные данные
// Выведите количество пострадавших драконов.
// Примеры
// входные данные
// Скопировать
// 1
// 2
// 3
// 4
// 12
// выходные данные
// Скопировать
// 12
// входные данные
// Скопировать
// 2
// 3
// 4
// 5
// 24
// выходные данные
// Скопировать
// 17
// Примечание
// В первом примере каждый первый дракон был жестоко бит сковородкой. Некоторым доставалось также от дверей и каблучков, но даже сковородки хватало всем.
// Во втором примере неповрежденными остались драконы 1, 7, 11, 13, 17, 19 и 23.

//Скольким воображаемым драконам успела нанести моральный или физический ущерб принцесса, если всего она насчитала d драконов?
// Входные данные
// Входные данные содержат целые числа k, l, m, n и d, каждое число в отдельной строке (1 ≤ k, l, m, n ≤ 10, 1 ≤ d ≤ 105).


int k = Convert.ToInt32(Console.ReadLine());// (1 ≤ k, l, m, n ≤ 10, 1 ≤ d ≤ 105) - каждый пострадавший драконы
int l = Convert.ToInt32(Console.ReadLine());
int m = Convert.ToInt32(Console.ReadLine());
int n = Convert.ToInt32(Console.ReadLine());

int d = Convert.ToInt32(Console.ReadLine()); //всего драконов

int totalAffectedDragons = 0;

for (int i = 1; i <= d; i++)
{
    if (i % k == 0) totalAffectedDragons++;
    else if (i % l == 0) totalAffectedDragons++;
    else if (i % m == 0) totalAffectedDragons++;
    else if (i % n == 0) totalAffectedDragons++;
}

Console.WriteLine(totalAffectedDragons);